package kavax.microedition.lcdui;

import java.io.*;

import javax.microedition.io.Connector;
import javax.microedition.io.file.FileConnection;

public class FH {
	public FH() {
	}

	public String[] Conversion(String s) {
		String ky = "";
		try {
			WRtxt wr = new WRtxt();
			ky = wr.ReadUTF$(s);
		} catch (Throwable throwable) {
			ky = "ÎÞÌØÊâ·ûºÅÎÄ¼þ|";
		}
		fuhao = new String[] {
				ky,
				"¨q¡É¨r£¨¦á¦ä¦á£©¨q¡É¨r±ÉÊÓÄã£¡|(>©n<)|O(¡É_¡É)O¹þ¹þ~|-_-#|{{{(>_<)}}}|*^¡ò^*|(¡¥(¡Þ)¡¥)|(¡« o ¡«)~zZ|¨I(^¦Ø^)¨J|£¨¡¥¦ê¡¥£©|~@^_^@~|(*+©n+*)|o(¦á¦ä¦á)o|~~~~£¨>_<)~~~~|(¨s©n¨t)b|(*^__^*) ÎûÎû¡­¡­|X©nX|(¡Ñ¡Ñ?)|o_O???|©¨©©|",
				"¨‰¨x¨y¨z¨{¨|¨}¨~¨€|¨€¨~¨}¨|¨{¨z¨y¨x¨‰|¨‚¨ƒ¨„¨…¨†¨‡|???????|",
				"[url=][/url]|[color=red green blue][/color]|[img][/img]|",
				"¢±¢²¢³¢´¢µ¢¶¢·¢¸¢¹¢º¢»¢¼¢½¢¾¢¿¢À¢Á¢Â¢Ã",
				"¢Ù¢Ú¢Û¢Ü¢Ý¢Þ¢ß¢à¢á¢â",
				"¢Å¢Æ¢Ç¢È¢É¢Ê¢Ë¢Ì¢Í¢Î¢Ï¢Ð¢Ñ¢Ò¢Ó¢Ô¢Õ¢Ö¢×¢Ø",
				"¢å¢æ¢ç¢è¢é¢ê¢ë¢ì¢í¢î",
				"£°£±£²£³£´£µ£¶£·£¸£¹",
				"¢ñ¢ò¢ó¢ô¢õ¢ö¢÷¢ø¢ù¢ú",
				"£Á£Â£Ã£Ä£Å£Æ£Ç£È£É£Ê£Ë£Ì£Í£Î£Ï£Ð£Ñ£Ò£Ó£Ô£Õ£Ö£×£Ø£Ù£Ú",
				"£á£â£ã£ä£å£æ£ç£è£é£ê£ë£ì£í£î£ï£ð£ñ£ò£ó£ô£õ£ö£÷£ø£ù£ú",
				"§¡§¢§£§¤§¥§¦§§§¨§©§ª§«§¬§­§®§¯§°§±§²§³§´§µ§¶§·§¸§¹§º§»§¼§½§¾§¿§À§Á§Ñ§Ò§Ó§Ô§Õ§Ö§×§Ø§Ù§Ú§Û§Ü§Ý§Þ§ß§à§á§â§ã§ä§å§æ§ç§è§é§ê§ë§ì§í§î§ï§ð§ñ",
				"‡å‡UŽ~ƒÌ‹›–T•õ®h©D©Cšì‡Ö‰øB^AL]‰å|}…y¡©@©Hþ@",
				"¦Ó¦Ô¦Õ¦×¦£¦¤¦¨¦«¦®¦°¦²¦µ¦Ø¦Æ¦·¦Á¦Â¦Ã¦Ä¦Å¦Æ¦Ç¦È¦É¦Ê¦Ë¦Ì¦Í¦Î¦Ï¦Ð¦Ñ¦Ò",
				"¨¤¨¢¨¨¨¦¨º¨¬¨ª¨°¨®¨´¨²¨¹¨»¨¡¨½¨µ¨¶¨¥¨­¨±¨©¨£¨¾¨·¨¸¨§¨¯¨³¨«¡Â¨À¨´¨²¨¹",
				"¨¡¨­¨¥¨©¨±¨µ¨¹¨º¨¢¨®¨¦¨ª¨²¨¶¨½¨»¨£¨¯¨§¨«¨³¨·¨¾¨¼¨¤¨°¨¨¨¬¨´¨¸¨¿¨À",
				"¨Å¨Æ¨Ç¨È¨É¨Ê¨Ë¨Ì¨Í¨Î¨Ï¨Ð¨Ñ¨Ò¨Ó¨Ô¨Õ¨Ö¨×¨Ø¨Ù¨Ú¨Û¨Ü¨Ý¨Þ¨ß¨à¨á¨â¨ã¨ä¨å¨æ¨ç¨è¨é",
				"¡â¡á¡Ì ¨w©€©¡Õ©J©K©L©M©N©O©P©Q©R©Smlmol¡ç¡ê£¤©T¡ë¨G¡ã¡æ¨H¡ä¨“¡è¦Ì©S©R¡é¡Æ¡Ì©Z¡í©Y^ `¡¦ £Þ¡¨©a©b¡Ò¡Ó¡×¡Ø¡Þ@&#…e…d¤Î¡ï¡î¡ð©I¡ñ©–¨‘¡Ñ¡ò¡Ç¡ù¡Ðìá",
				"¡¾¡¿¡¼¡½¡¸¡¹¡º¡»£Û£Ý©³ ©·©» ©¿¡Ü¡Ý¨Q¨R¦ç¦æ¦î¦ï¡Ä¡Å¡ú¡û¨K¨L£¯£Ü¡ü¡ý©ª©«£¯\\£ü¨u¡Î¨v¨“¡Ï",
				"¨‹¡ø¨Œ¡÷¡Æ¨ˆ¡þ¡ô¡ó¡ö¡õ¨Ž¨¨¨¡È¡É¡Ô¨p¨q  ¨r¨t  ¨s©×¨P",
				"¥ß¨è¡©¤¡¤¢¤£¤¤¤¥¤¦¤§¤¨¥É¥Ê¥Ì¥Í¥Î¥Ï¥Ð¥Ñ¥Û¥Ü¥Ý¥Þ¥ß¥à¥á¥â¥ì¤¯¤°¤±¤²¤³¤´¤µ¤¶¤·¥î¥ï¥ð¥ñ¥ò¥ó¥ô¥õ¥ö¥­¥®¥¯¥°¥±¥³¥´¥µ¥¶¤©¤ª¤«¤¬¤­¤®¥ã¥ä¥å¥æ¥ç¥è¥é¥ê¥ë¥¡¥¢¥£¥¤¥¥¥¦¥©¥¬¥Ò¥Ó¥Ô¥Õ¥Ö¥×¥Ø¥Ù¥Ú¥·¥¸¥¹¥º¥»¥¼¥½¥¾¥¿¥À¥Á¥Â¥Ã¥Ä¥Å¥Æ¥Ç" };

		return fuhao;
	}

	private String fuhao[];
}